[
  {
    "Title": "Bumi Manusia",
    "Author": "Pramoedya Ananta Toer",
    "Genre": "Fiksi Sejarah",
    "Year": 1980,
    "Description": "Bagian pertama dari Tetralogi Buru, novel ini menceritakan perjuangan seorang pemuda Jawa bernama Minke melawan ketidakadilan kolonial Belanda, sekaligus kisah cintanya dengan Annelies, gadis Indo-Eropa."
  },
  {
    "Title": "Sepatu Dahlan",
    "Author": "Khrisna Pabichara",
    "Genre": "Fiksi Biografi, Inspiratif",
    "Year": 2012,
    "Description": "Terinspirasi dari masa kecil Dahlan Iskan, buku ini menggambarkan perjuangan seorang anak desa yang bermimpi memiliki sepatu dan bagaimana mimpinya membentuk karakter pekerja keras dan pantang menyerah."
  },
  {
    "Title": "Perahu Kertas",
    "Author": "Dee Lestari",
    "Genre": "Fiksi Romantis",
    "Year": 2009,
    "Description": "Mengisahkan perjalanan cinta Kugy dan Keenan, dua individu yang berjuang meraih mimpi masing-masing sambil mencari arti cinta dan takdir."
  },
  {
    "Title": "Supernova: Ksatria, Puteri, dan Bintang Jatuh",
    "Author": "Dee Lestari",
    "Genre": "Fiksi Kontemporer, Filosofis",
    "Year": 2001,
    "Description": "Buku pertama dari seri Supernova, yang menggabungkan cerita cinta, sains, dan filsafat. Kisahnya berpusat pada kehidupan Rana dan Ferre, dengan narasi penuh refleksi mendalam tentang makna kehidupan."
  },
  {
    "Title": "Orang-Orang Biasa",
    "Author": "Andrea Hirata",
    "Genre": "Fiksi Sosial",
    "Year": 2019,
    "Description": "Cerita tentang sekelompok orang desa dengan kehidupan sederhana yang terlibat dalam peristiwa besar, mengungkap sisi humor dan kegetiran dalam kehidupan sehari-hari."
  },
  {
    "Title": "Laskar Pelangi",
    "Author": "Andrea Hirata",
    "Genre": "Fiksi Inspiratif, Sosial",
    "Year": 2005,
    "Description": "Kisah sekelompok anak di Belitung yang penuh semangat untuk belajar meskipun di tengah keterbatasan fasilitas sekolah dan kemiskinan. Buku ini menggambarkan pentingnya pendidikan, persahabatan, dan mimpi besar."
  }
]